---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectShape
source: html/4cff2d19-a0a2-ffdf-4a53-8467ccaf9dc0.htm
---
# DirectShape Properties

A text string that identifies the data to the creating application.